Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>fCvXbn/qva9LmtYPpLll5pLHMppcgvXjzF7tAALhKbQonk3ErEt0FFfATXr7JDHpZ/1cz5Wv7bDM&#13;
yGzQyMhX6pK7jylgnNkukIJxXLl9r24lSEuLQylXhB6UTXnjgwgBjK+lsTT9s/2Uy3a/i1a1RdLT&#13;
aiTn5AJM0GBqZgSIjVO7zLYDBED4Xfv3/jYX5vub9+DJTYFpEpvcP8QFtJ3YN1Hd7aUTYA0syWw+&#13;
3i9WVVLxyMUmUJn19uYpPwGkMoYJeAtNE5YGPZ3/viS4+E13hcuJ7GQhgmn6u7z6lSdprPu4Z1mB&#13;
7Srzabc5KKmSifhUHGBaXQ07Pobf9ypr7cVTIQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>v/izsYdGTsYUKNPr/G8MG6W7HV2aPOlYveZj0FG5VFDsXQb7JJRucHkE3CHTW+VpaEb4IfFbBHF5&#13;
sa8wOoMz3B1mTnklAwLK1JtmkwPX3tttcfd4pm1xgeyYcbjXA3UD2r0XQuRQWNs87fHjMdHTOQA6&#13;
tlaj53YEutArq37Wct71SjO4MJ+h8Sk/eL+oqqZo7nRrtpCoalDTOqQXBBZePIuNCKGpgU2n3Yi0&#13;
KNOb+JEKto2QpJqUuTBkFze7GsN3n2G0tyieXgEaAHgcVSYEUmeN6BAdh7y9kWavRDysanF/juPN&#13;
hYyY1WHzf5NkiX3Ji3UYbl+b2/wBdX0CR3Q8Jq2zJePB2wTgToHEIO8VAZx54us2mugJlJXVpAur&#13;
8EFC/JuK+YMwE+E3wIyItTOqf5A2Ifg1Vpei6ntQ3u0GyVEa5t3ppwTQE8NMPypMaiZ4KVSP1rQN&#13;
BnvcIIpzlYk/h9akWev03JM+90RYRKASv/JcuzPycHuaY9pyxulLV/WnrZlv273qWHnG0/+deaTF&#13;
7GfX6kpF7cxSMgcMoP2WWhUDkODR/ccTT5AqYsWS2612mhcafKzbihRiPFU7lTVLYAVNrJLoJdal&#13;
7H3Lm+7p83iHBvZ9S7bsNMNWp/sZoQKK2JViYObRdsRxed9kMZOVrtxmADRT3k4YomYPmjaHIR+9&#13;
sa0O3LkAXknGjhSeYd6bO45GO8pTGqv3g1Ag+l24raY/0Y1K5PLx0MN0mzDU0ION/sIB3Vsp4Kzf&#13;
SJHbWpne7DvnnRZnZ+GKJH1X337+UjLQElbsHaIUuLW0Bdcc65kB8Pd8lCKO+aQsT45BmYfZLUk+&#13;
gUZXYCNkcn8ZBsvk4Na30CPFJPsScAtotyvC7jChaNQwzi3pHvqdoc3c3Ku9MES/uTUUkSg9xvTh&#13;
2cdLaLUn3Sc5GCwVoo2gtjcsM5evRovh3nqQcPFKg11c87vk</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>wIttSvEBjNb92lsk/b5/cGJyqQs=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
a+P3ikU3nCbDHjPciFxprQuqtRjDZgZgpjW5H4h3nNI1t1SbZMaG5Orjn8+yFZxLB9G6TrFKDHd8&#13;
50/YU8QLgEDOs4sWQ0lya3vbntShmGw4ILQiNTTHQ8tjzgAmPAgHfvSt/cKUgyHsW8estqjNcl/u&#13;
iIlv/B3OrRKjp/n5gpVIrBWYw0HU0ANvlqUGfkl9oNOvqdHJWO1xyTmvqnAvJP0rtxkwAWUXNt+q&#13;
9NKwNngtUpB54ZoP9J/Vhl1TcWq6HCFo+1uUP+jqGr6Y/E2v8MqNu+WZfCBOCAY1Aa90cqN7Dd03&#13;
CMNPgCoDHLEVagbRIEqWYGFct7rsn96Hhcp20g==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>